In [2]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','Apple','Apple','FB','FB'],
       'Person':['Azam','Shami','Rizwan','Rohan','Anand','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [5]:
df = pd.DataFrame(data)

In [6]:
df

  Company  Person  Sales
0    GOOG    Azam    200
1    GOOG   Shami    120
2   Apple  Rizwan    340
3   Apple   Rohan    124
4      FB   Anand    243
5      FB   Sarah    350

In [9]:
by_Comp = df.groupby('Company')

In [12]:
by_Comp.mean()

         Sales
Company
Apple    232.0
FB       296.5
GOOG     160.0

In [13]:
df.groupby('Company').mean()

         Sales
Company
Apple    232.0
FB       296.5
GOOG     160.0